public class Main {
    public static void main(String[] args) {


        //Задание 3
        //Используя IntelliJ IDEA, создайте проект. Создайте три строковые переменные и присвойте им значения:
        //"\nмоя строка 1"
        //"\tмоя строка 2"
        //"\aмоя строка 3"
        //Выведите значение каждой переменной на экран. Какие отличия вы увидели. Сделайте выводы.

        String one = "\nмоя строка 1";  // переводит курсор на следующую строку
        System.out.println(one);
        String two = "\tмоя строка 2"; // создает абзац
        System.out.println(two);
        String three = "\fмоя строка 3"; // \а как написано в задании выдает ошибку, я попробовал \f, но так и не понял
        System.out.println(three);       // для чего используется этот символ
    }
}
