import java.util.Scanner;
public class Delivery {
    public static void main(String[] args) {

        //Задание 4
        //Имеется N клиентов, которым компания производитель должна доставить товар. Сколько существует возможных
        // маршрутов доставки товара, с учетом того, что товар будет доставлять одна машина? Используя IntelliJ IDEA,
        // создайте класс Delivery. Напишите программу, которая будет рассчитывать, и выводить на экран количество
        // возможных вариантов доставки товара. Для решения задачи, используйте факториал N!,
        // рассчитываемый с помощью цикла do-while.


        Scanner sc = new Scanner(System.in);
        int n = sc.nextInt();
        int car = 1;
        do {
            car *= n--;
        } while (n > 0);
        System.out.println(car);















    }
}
