import java.util.Scanner;
public class Premium {
    public static void main(String[] args) {

        // Задание 4
        // Используя IntelliJ IDEA, создайте класс Premium. Напишите программу расчета начисления премий сотрудникам.
        // Премии рассчитываются согласно выслуге лет. Если выслуга до 5 лет, премия составляет 10% от заработной платы.
        // Если выслуга от 5 лет (включительно) до 10 лет, премия составляет 15% от заработной платы.
        // Если выслуга от 10 лет (включительно) до 15 лет, премия составляет 25% от заработной платы.
        // Если выслуга от 15 лет (включительно) до 20 лет, премия составляет 35% от заработной платы.
        // Если выслуга от 20 лет (включительно) до 25 лет, премия составляет 45% от заработной платы.
        // Если выслуга от 25 лет (включительно) и более, премия составляет 50% от заработной платы.
        // Результаты расчета, выведите на экран.

        Scanner sc = new Scanner(System.in);
        System.out.println("Программа расчета начисления премий сотрудникам, ответьте правильно на поставленные вопросы");
        System.out.println("Введите сумму вашей заработной платы в месяц: ");
        double zp = sc.nextDouble();
        System.out.println("Укажите сколько лет Вы работаете на нашей работе: ");
        int years = sc.nextInt();
        if (years < 5) {
            System.out.println("Премия составляет 10% от заработной платы: " + zp * 0.1);
        } else if (years >= 5 && years < 10) {
            System.out.println("Премия составляет 15% от заработной платы: " + zp * 0.15);
        } else if (years >= 10 && years < 15) {
            System.out.println("Премия составляет 25% от заработной платы: " + zp * 0.25);
        } else if (years >= 15 && years < 20) {
            System.out.println("Премия составляет 35% от заработной платы: " + zp * 0.35);
        } else if (years >= 20 && years < 25) {
            System.out.println("Премия составляет 45% от заработной платы: " + zp * 0.45);
        } else if (years >= 25) {
            System.out.println("Премия составляет 50% от заработной платы: " + zp * 0.5);
        } else {
            System.out.println("Проверьте введенные данные!");
        }


    }
}
